## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.acr_dns_zone.azurerm_private_dns_zone.dns_zone will be created
  + resource "azurerm_private_dns_zone" "dns_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurecr.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "aztf-spoke-rg"

      + soa_record (known after apply)
    }

  # module.acr_dns_zone.azurerm_private_dns_zone_virtual_network_link.vnet_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "spoke_to_acrs"
      + private_dns_zone_name = "privatelink.azurecr.io"
      + registration_enabled  = false
      + resource_group_name   = "aztf-spoke-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.appgw["blue"].azurerm_application_gateway.agw will be created
  + resource "azurerm_application_gateway" "agw" {
      + id                          = (known after apply)
      + location                    = "northeurope"
      + name                        = "blue-appgw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "aztf-spoke-rg"

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "aztf-spoke-vnet-beap"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "aztf-spoke-vnet-be-htst"
          + path                                = "/path1/"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "aztf-spoke-vnet-feip"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "aztf-spoke-vnet-feport"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "app-gateway-ip-configuration"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "aztf-spoke-vnet-feip"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "aztf-spoke-vnet-feport"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "aztf-spoke-vnet-httplstn"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
            # (4 unchanged attributes hidden)
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "aztf-spoke-vnet-beap"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "aztf-spoke-vnet-be-htst"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "aztf-spoke-vnet-httplstn"
          + id                          = (known after apply)
          + name                        = "aztf-spoke-vnet-rqrt"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + sku {
          + capacity = 2
          + name     = "WAF_v2"
          + tier     = "WAF_v2"
        }

      + ssl_policy (known after apply)

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Detection"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.2"
        }
    }

  # module.appgw_nsgs.azurerm_network_security_group.appgw-nsg will be created
  + resource "azurerm_network_security_group" "appgw-nsg" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "aztf-spoke-vnet-appgw-nsg"
      + resource_group_name = "aztf-spoke-rg"
      + security_rule       = (known after apply)
    }

  # module.appgw_nsgs.azurerm_network_security_rule.DenyAllInBound will be created
  + resource "azurerm_network_security_rule" "DenyAllInBound" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInBound"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 1000
      + protocol                    = "*"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.appgw_nsgs.azurerm_network_security_rule.controlplane will be created
  + resource "azurerm_network_security_rule" "controlplane" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "65200-65535"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowControlPlane"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 110
      + protocol                    = "*"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.appgw_nsgs.azurerm_network_security_rule.healthprobes will be created
  + resource "azurerm_network_security_rule" "healthprobes" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHealthProbes"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 120
      + protocol                    = "*"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "AzureLoadBalancer"
      + source_port_range           = "*"
    }

  # module.appgw_nsgs.azurerm_network_security_rule.inboundhttps will be created
  + resource "azurerm_network_security_rule" "inboundhttps" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow443InBound"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "Internet"
      + source_port_range           = "*"
    }

  # module.appgw_nsgs.azurerm_subnet_network_security_group_association.appgwassoc will be created
  + resource "azurerm_subnet_network_security_group_association" "appgwassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.kv_dns_zone.azurerm_private_dns_zone.dns_zone will be created
  + resource "azurerm_private_dns_zone" "dns_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "aztf-spoke-rg"

      + soa_record (known after apply)
    }

  # module.kv_dns_zone.azurerm_private_dns_zone_virtual_network_link.vnet_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "spoke_to_kvs"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "aztf-spoke-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.peering.azurerm_virtual_network_peering.hub_to_spoke will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "aztf-hub-vnet-to-aztf-spoke-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "aztf-hub-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "aztf-hub-vnet"
    }

  # module.peering.azurerm_virtual_network_peering.spoke_to_hub will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "aztf-spoke-vnet-to-aztf-hub-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/virtualNetworks/aztf-hub-vnet"
      + resource_group_name                    = "aztf-spoke-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "aztf-spoke-vnet"
    }

  # module.pip["blue"].azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "blue-appgw-pip"
      + resource_group_name     = "aztf-spoke-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.spoke_networking.azurerm_network_security_group.nsgs["akssubnet"] will be created
  + resource "azurerm_network_security_group" "nsgs" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "akssubnet-nsg"
      + resource_group_name = "aztf-spoke-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Git"         = "Github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "spoke"
          + "Source"      = "Terraform"
        }
    }

  # module.spoke_networking.azurerm_resource_group.spoke_rg will be created
  + resource "azurerm_resource_group" "spoke_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "aztf-spoke-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Git"         = "Github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "spoke"
          + "Source"      = "Terraform"
        }
    }

  # module.spoke_networking.azurerm_route_table.route_tables["akssubnet"] will be created
  + resource "azurerm_route_table" "route_tables" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "aztf-spoke-rt"
      + resource_group_name           = "aztf-spoke-rg"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "route_to_firewall"
              + next_hop_in_ip_address = "10.0.1.4"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
      + tags                          = {
          + "Environment" = "Dev"
          + "Git"         = "Github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "spoke"
          + "Source"      = "Terraform"
        }
    }

  # module.spoke_networking.azurerm_subnet.spoke_subnets["akssubnet"] will be created
  + resource "azurerm_subnet" "spoke_subnets" {
      + address_prefixes                              = [
          + "10.1.16.0/20",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "akssubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-spoke-rg"
      + virtual_network_name                          = "aztf-spoke-vnet"
    }

  # module.spoke_networking.azurerm_subnet.spoke_subnets["appgwsubnet"] will be created
  + resource "azurerm_subnet" "spoke_subnets" {
      + address_prefixes                              = [
          + "10.1.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "appgwsubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-spoke-rg"
      + virtual_network_name                          = "aztf-spoke-vnet"
    }

  # module.spoke_networking.azurerm_subnet_network_security_group_association.nsg_associations["akssubnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_associations" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.spoke_networking.azurerm_subnet_route_table_association.rt_associations["akssubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "rt_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke_networking.azurerm_virtual_network.spoke_vnet will be created
  + resource "azurerm_virtual_network" "spoke_vnet" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "aztf-spoke-vnet"
      + resource_group_name = "aztf-spoke-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Git"         = "Github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "spoke"
          + "Source"      = "Terraform"
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.
```
</details>